x.repeat(y) // this method repeat x value y times
x.map() // Метод map() создаёт новый массив с результатом вызова указанной функции для каждого элемента массива.
// return x.map((i) => i * 2);
// String
String.includes() //Метод includes() проверяет, содержит ли строка заданную подстроку, и возвращает, соответственно true или false.
String.endsWith() // Метод endsWith() позволяет определить, заканчивается ли строка символами указанными в скобках, возвращая, соответственно, true или false.
arguments[0] // Можно сделать проверку аргументов функции
String.charAt() // Метод charAt() возвращает указанный символ из строки. (проверка на какой позиции буква)
String.trim()  // Метод trim() удаляет пробельные символы с начала и конца строки. Пробельными символами в этом контексте считаются все собственно пробельные символы.